app/controllers/admin_controller.rb

  def index
    @total_products = Product.count
---
SELECT COUNT(*) FROM "products"