app/controllers/comments_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "33"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "This is a good movie"], ["commenter", "Foluso"], ["created_at", Sat, 10 Mar 2012 10:56:30 UTC +00:00], ["product_id", 33], ["updated_at", Sat, 10 Mar 2012 10:56:30 UTC +00:00]]
---
  def create
    @product = Product.find(params[:product_id])
    @comment = @product.comments.create(params[:comment])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "32"]]
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = 32 AND "comments"."id" = ? LIMIT 1  [["id", "12"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 12]]
---
  def destroy
    @product = Product.find(params[:product_id])
    @comment = @product.comments.find(params[:id])
    @comment.destroy