app/controllers/members_controller.rb

  def index
    @members = Member.order(:name)
---
SELECT "members".* FROM "members" ORDER BY name

  def create
    @member = Member.new(params[:member])

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)

  def update
    @member = Member.find(params[:id])

    respond_to do |format|
      if @member.update_attributes(params[:member])
---
SELECT "members".* FROM "members" WHERE "members"."id" = 11 LIMIT 1
UPDATE "members" SET "name" = 'sam', "password_digest" = '$2a$10$Z7rj2Jymh7kz6FUhvwW6a.xFEjUNCPjEgT6txMs/j2veA4Nf5pOGy', "updated_at" = '2012-03-16 14:37:09.379478' WHERE "members"."id" = 980190962

def destroy
    @member = Member.find(params[:id])
  begin
    @member.destroy
---
SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 5]]