app/controllers/movie_controller.rb

SELECT "products".* FROM "products" ORDER BY title
---
  def index
    @products = Product.order(:title)