app/controllers/products_controller.rb

 def search
   @products = Product.find(:all, :conditions => [" title LIKE ? OR description LIKE ? OR image_url LIKE ? OR price LIKE ?", "%#{params[:key]}%", "%#{params[:key]}%", "%#{params[:key]}%", "%#{params[:key]}%"])
---
SELECT "products".* FROM "products" WHERE ( title LIKE '%titanic%' OR description LIKE '%titanic%' OR image_url LIKE '%titanic%' OR price LIKE '%titanic%')

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "22"]]
UPDATE "products" SET "title" = 'Man in the Mirror', "description" = 'man that was charged with rape. and wanted to be rescued by the dog that raped the mother of the father without using a condom....lol', "image_url" = 'rails.png', "price" = 119.0, "updated_at" = '2012-03-01 13:08:49.724172' WHERE "products"."id" = 23