app/controllers/sessions_controller.rb

SELECT "members".* FROM "members" WHERE "members"."name" = 'foluso' LIMIT 1
---
  def create
    member = Member.find_by_name(params[:name])