app/views/products/show.html.erb

<h2><u>Members' Comments:</u></h2>
<% @product.comments.each do |comment|%>
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" = 33